      ******************************************************************
      * Author: Carlos Sebastian Madrigal Rodriguez.
      * Date: 18/10/20.
      * Purpose: Aprendizaje.
      * Tectonics: cobc.
      ******************************************************************
       IDENTIFICATION DIVISION.
       PROGRAM-ID. HOLA-COBOL.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY "Hola Mundo!"
            STOP RUN.
       END PROGRAM HOLA-COBOL.
