000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. Prueba.
       AUTHOR. Sebastian Madrigal.
       DATE-WRITTEN. Oct 19 2020.
       DATE-COMPILED. Oct 19 2020.

000300 ENVIRONMENT DIVISION.
000400 CONFIGURATION SECTION.
       SOURCE-COMPUTER. Linux PC.
       OBJECT-COMPUTER. Linux PC.

000500 SPECIAL-NAMES.

000800 INPUT-OUTPUT SECTION.
000900 FILE-CONTROL.
001000 DATA DIVISION.
001100 FILE SECTION.
001200
001300 WORKING-STORAGE SECTION.
001400 01 Nombre PIC X(5) VALUE "Sebas".
       01 Username PIC X(30) VALUE ZEROS.
       01 SSnum.
           02 SSArea PIC 999.
           02 SSGroup PIC 99.
           02 SSSerial PIC 9999.
       01 Pi CONSTANT AS 3.14.
001800 LINKAGE SECTION.
001900 SCREEN SECTION.

002000 PROCEDURE DIVISION.
           DISPLAY "Cual es tu nombre? " WITH NO ADVANCING
           ACCEPT Username
           DISPLAY "Hola " Username
           DISPLAY "Sabias que el numero PI = " Pi
           MOVE 123456789 TO SSnum
           DISPLAY "El numero de Area es: "SSArea
           STOP RUN.
