000100 IDENTIFICATION DIVISION.
000200     PROGRAM-ID. Prueba.
000300     AUTHOR. Carlos Sebastian Madrigal Rodriguez.
           INSTALLATION. GNU Cobol.
           DATE-WRITTEN. Feb 9 2022 (09/02/22).
           DATE-COMPILED. Feb 9 2022 (09/02/22).
           SECURITY. Non-Confidential.

000400 ENVIRONMENT DIVISION.
000500 CONFIGURATION SECTION.
000600     SOURCE-COMPUTER. x64-Based-Linux-Kernel.
           OBJECT-COMPUTER. x64-Based-Linux-Kernel.
           SPECIAL-NAMES.

000900 DATA DIVISION.
001000 FILE SECTION.
001100 WORKING-STORAGE SECTION.
       01 VAR PIC 99.

001200 PROCEDURE DIVISION.
001300 MAIN-PROC.
001400     COMPUTE VAR = 6 / 3 END-COMPUTE.
           DISPLAY "Hola Mundo desde COBOL. El resultado de la "
           "computacion es: ", VAR
           END-DISPLAY.
           GOBACK.
       END PROGRAM Prueba.
